
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>配置模块 · High Performance Web Server manual</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-insert-logo/plugin.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-code/plugin.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-chapter-fold/chapter-fold.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-theme-hqbook/theme.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../Thread/" />
    
    
    <link rel="prev" href="../Env/" />
    

    
        <link rel="shortcut icon" href='../../img/favicon.png' type="image/x-icon">
    
    
        <link rel="bookmark" href='../../img/favicon.png' type="image/x-icon">
    
    
        <link rel="apple-touch-icon" href='../../img/favicon.png'>
    
    
        
        <link rel="apple-touch-icon" sizes="120x120" href="../../img/favicon.png">
        
        <link rel="apple-touch-icon" sizes="180x180" href="../../img/favicon.png">
        
    

    </head>
    <body>
        
<div class="book">
    <div class="header-inner">
        <!-- LOGO -->
        <div class="logo">
            <img src="" alt="logo">
        </div>
        <span class="title"></span>

        <!-- Search -->
        
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>


        <!-- Nav -->
        <ul class="header-nav">
            <li>
                <a href="" target=""></a>
            </li>
        </ul>
    </div>

    <div class="book-summary">
        <!--<div class="book-summary-title">文档目录</div>-->
        
        
        <nav role="navigation">
            


<ul class="summary">
    
    
    
        
        <li>
            <a href="http://github.com/JUHPS" target="_blank" class="custom-link">GitHub</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    首页
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../../Welcome.html">
            
                <a href="../../Welcome.html">
            
                    
                    介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../../getStarted/">
            
                <a href="../../getStarted/">
            
                    
                    开始部署
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../../getStarted/common/Prepare.html">
            
                <a href="../../getStarted/common/Prepare.html">
            
                    
                    准备工作
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../../getStarted/common/StartJUHPS.html">
            
                <a href="../../getStarted/common/StartJUHPS.html">
            
                    
                    启动系统
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../">
            
                <a href="../">
            
                    
                    服务器
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../Logger/">
            
                <a href="../Logger/">
            
                    
                    日志模块
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="../Env/">
            
                <a href="../Env/">
            
                    
                    环境变量模块
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4.3" data-path="./">
            
                <a href="./">
            
                    
                    配置模块
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.4" data-path="../Thread/">
            
                <a href="../Thread/">
            
                    
                    线程模块
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.5" data-path="../Fiber/">
            
                <a href="../Fiber/">
            
                    
                    协程模块
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.6" data-path="../Scheduler/">
            
                <a href="../Scheduler/">
            
                    
                    协程调度模块
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.7" data-path="../IOManager/">
            
                <a href="../IOManager/">
            
                    
                    IO协程调度模块
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.8" data-path="../Timer/">
            
                <a href="../Timer/">
            
                    
                    定时器模块
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.9" data-path="../Hook/">
            
                <a href="../Hook/">
            
                    
                    Hook模块
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.10" data-path="../Address/">
            
                <a href="../Address/">
            
                    
                    网络地址模块
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.11" data-path="../Socket/">
            
                <a href="../Socket/">
            
                    
                    Socket模块
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.12" data-path="../ByteArray/">
            
                <a href="../ByteArray/">
            
                    
                    ByteArray序列化模块
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.13" data-path="../Stream/">
            
                <a href="../Stream/">
            
                    
                    字节流序列化模块
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.14" data-path="../TcpServer/">
            
                <a href="../TcpServer/">
            
                    
                    TcpServer模块
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


        </nav>
        
        
    </div>

    <!-- Content nav -->
    <div class="book-anchor">
        <!--<div class="book-anchor-title">在这篇文章中:</div>-->
        <div class="book-anchor-body">

        </div>
    </div>

    <div class="book-body">
        
        <div class="body-inner">
            
            

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >配置模块</a>
    </h1>
</div>




            <div class="page-wrapper" tabindex="-1" role="main">
                <div class="page-inner">
                    
<div id="book-search-results">
    <div class="search-noresults">
    
                    <section class="normal markdown-section">
                        
                        <h1 id="&#x914D;&#x7F6E;&#x6A21;&#x5757;">&#x914D;&#x7F6E;&#x6A21;&#x5757;</h1>
<blockquote>
<p>&#x7528;&#x4E8E;&#x5B9A;&#x4E49;/&#x58F0;&#x660E;&#x914D;&#x7F6E;&#x9879;&#xFF0C;&#x5E76;&#x4E14;&#x4ECE;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x4E2D;&#x52A0;&#x8F7D;&#x7528;&#x6237;&#x914D;&#x7F6E;&#xFF0C;&#x4F53;&#x73B0;&#x7EA6;&#x5B9A;&#x5927;&#x4E8E;&#x914D;&#x7F6E;&#x7684;&#x601D;&#x60F3;&#xFF0C;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x91C7;&#x7528;yml&#xFF0C;&#x5E76;&#x7528;yaml-cpp&#x8FDB;&#x884C;&#x89E3;&#x6790;&#xFF0C;&#x7528;&#x7247;&#x7279;&#x5316;&#x7684;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x7684;&#x5E8F;&#x5217;&#x5316;&#x548C;&#x53CD;&#x5E8F;&#x5217;&#xFF0C;&#x5E76;&#x7528;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x7684;&#x673A;&#x5236;&#x4F7F;&#x5176;&#x751F;&#x6548;&#x3002;</p>
</blockquote>
<p>&#x53C2;&#x8003;&#x8C37;&#x6B4C;&#x5F00;&#x6E90;&#x7684;&#x57FA;&#x4E8E;&#x547D;&#x4EE4;&#x884C;&#x7684;C++&#x914D;&#x7F6E;&#x5E93;&#xFF1A;gflags</p>
<p><img src="../../img/ConfigUML.jpeg" alt="&#x914D;&#x7F6E;&#x6A21;&#x5757;UML"></p>
<h2 id="1-&#x6A21;&#x5757;&#x8BBE;&#x8BA1;">1. &#x6A21;&#x5757;&#x8BBE;&#x8BA1;</h2>
<blockquote>
<p>&#x91C7;&#x7528;&#x7EA6;&#x5B9A;&#x4F18;&#x4E8E;&#x914D;&#x7F6E;&#x7684;&#x601D;&#x60F3;</p>
</blockquote>
<p>&#x7B80;&#x5355;&#x6765;&#x8BF4;&#xFF0C;&#x7EA6;&#x5B9A;&#x4F18;&#x4E8E;&#x914D;&#x7F6E;&#x7684;&#x80CC;&#x666F;&#x6761;&#x4EF6;&#x662F;&#xFF0C;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x7A0B;&#x5E8F;&#x6240;&#x4F9D;&#x8D56;&#x7684;&#x914D;&#x7F6E;&#x9879;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x516C;&#x8BA4;&#x7684;&#x9ED8;&#x8BA4;&#x503C;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6240;&#x8C13;&#x7684;&#x7EA6;&#x5B9A;&#x3002;&#x8FD9;&#x70B9;&#x6709;&#x53EF;&#x8BB8;&#x591A;&#x53EF;&#x4EE5;&#x53C2;&#x8003;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x6BD4;&#x5982;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;http&#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x670D;&#x52A1;&#x7AEF;&#x53E3;&#x901A;&#x5E38;&#x90FD;&#x662F;80&#x7AEF;&#x53E3;&#xFF0C;&#x5BF9;&#x4E8E;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x5939;&#x8DEF;&#x5F84;&#xFF0C;&#x4E00;&#x822C;&#x90FD;&#x662F;conf&#x6587;&#x4EF6;&#x5939;&#xFF0C;&#x5BF9;&#x4E8E;&#x6570;&#x636E;&#x5E93;&#x76EE;&#x5F55;&#xFF0C;&#x4E00;&#x822C;&#x90FD;&#x662F;db&#x6216;data&#x6587;&#x4EF6;&#x5939;&#x3002;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E9B;&#x5177;&#x6709;&#x516C;&#x8BA4;&#x7EA6;&#x5B9A;&#x7684;&#x914D;&#x7F6E;&#xFF0C;&#x5C31;&#x4E0D;&#x9700;&#x8981;&#x9EBB;&#x70E6;&#x7A0B;&#x5E8F;&#x5458;&#x5728;&#x7A0B;&#x5E8F;&#x8DD1;&#x8D77;&#x6765;&#x540E;&#x518D;&#x4E00;&#x9879;&#x4E00;&#x9879;&#x5730;&#x6307;&#x5B9A;&#x4E86;&#xFF0C;&#x800C;&#x662F;&#x53EF;&#x4EE5;&#x521D;&#x59CB;&#x65F6;&#x5C31;&#x5C06;&#x914D;&#x7F6E;&#x9879;&#x8BBE;&#x7F6E;&#x6210;&#x5BF9;&#x5E94;&#x7684;&#x503C;&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x5C31;&#x53EF;&#x4EE5;&#x53EA;&#x4FEE;&#x6539;&#x90A3;&#x4E9B;&#x7EA6;&#x5B9A;&#x4E4B;&#x5916;&#x7684;&#x914D;&#x7F6E;&#x9879;&#xFF0C;&#x7136;&#x540E;&#x4EE5;&#x6700;&#x5C0F;&#x7684;&#x4EE3;&#x4EF7;&#x8BA9;&#x7A0B;&#x5E8F;&#x8DD1;&#x8D77;&#x6765;&#x3002;</p>
<p>&#x7EA6;&#x5B9A;&#x4F18;&#x4E8E;&#x914D;&#x7F6E;&#x7684;&#x65B9;&#x5F0F;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x7A0B;&#x5E8F;&#x5458;&#x505A;&#x51B3;&#x5B9A;&#x7684;&#x6570;&#x91CF;&#xFF0C;&#x83B7;&#x5F97;&#x7B80;&#x5355;&#x7684;&#x597D;&#x5904;&#xFF0C;&#x540C;&#x65F6;&#x517C;&#x987E;&#x7075;&#x6D3B;&#x6027;&#x3002;</p>
<p>&#x4E00;&#x822C;&#x800C;&#x8A00;&#xFF0C;&#x4E00;&#x9879;&#x914D;&#x7F6E;&#x5E94;&#x8BE5;&#x5305;&#x62EC;&#x4EE5;&#x4E0B;&#x8981;&#x7D20;&#xFF1A;</p>
<ol>
<li><p>&#x540D;&#x79F0;&#xFF0C;&#x5BF9;&#x5E94;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x5FC5;&#x987B;&#x552F;&#x4E00;&#xFF0C;&#x4E0D;&#x80FD;&#x4E0E;&#x5176;&#x4ED6;&#x914D;&#x7F6E;&#x9879;&#x4EA7;&#x751F;&#x51B2;&#x7A81;&#x3002;</p>
</li>
<li><p>&#x7C7B;&#x578B;&#xFF0C;&#x53EF;&#x4EE5;&#x662F;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#xFF0C;&#x4F46;&#x4E5F;&#x5E94;&#x8BE5;&#x652F;&#x6301;&#x590D;&#x6742;&#x7C7B;&#x578B;&#x548C;&#x81EA;&#x5B9A;&#x4E49;&#x7C7B;&#x578B;&#x3002;</p>
</li>
<li><p>&#x503C;&#x3002;</p>
</li>
<li><p>&#x9ED8;&#x8BA4;&#x503C;&#xFF0C;&#x8003;&#x8651;&#x5230;&#x7528;&#x6237;&#x4E0D;&#x4E00;&#x5B9A;&#x603B;&#x662F;&#x4F1A;&#x663E;&#x5F0F;&#x5730;&#x7ED9;&#x914D;&#x7F6E;&#x9879;&#x8D4B;&#x503C;&#xFF0C;&#x6240;&#x4EE5;&#x914D;&#x7F6E;&#x9879;&#x6700;&#x597D;&#x6709;&#x4E00;&#x4E2A;&#x9ED8;&#x8BA4;&#x503C;&#x3002;</p>
</li>
<li><p>&#x914D;&#x7F6E;&#x53D8;&#x66F4;&#x901A;&#x77E5;&#xFF0C;&#x4E00;&#x65E6;&#x7528;&#x6237;&#x66F4;&#x65B0;&#x4E86;&#x914D;&#x7F6E;&#x503C;&#xFF0C;&#x90A3;&#x4E48;&#x5E94;&#x8BE5;&#x901A;&#x77E5;&#x6240;&#x6709;&#x4F7F;&#x7528;&#x4E86;&#x8FD9;&#x9879;&#x914D;&#x7F6E;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x4EE5;&#x4FBF;&#x4E8E;&#x8FDB;&#x884C;&#x4E00;&#x4E9B;&#x5177;&#x4F53;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x6BD4;&#x5982;&#x91CD;&#x65B0;&#x6253;&#x5F00;&#x6587;&#x4EF6;&#xFF0C;&#x91CD;&#x65B0;&#x8D77;&#x76D1;&#x542C;&#x7AEF;&#x53E3;&#x7B49;&#x3002;</p>
</li>
<li><p>&#x6821;&#x9A8C;&#x65B9;&#x6CD5;&#xFF0C;&#x66F4;&#x65B0;&#x914D;&#x7F6E;&#x65F6;&#x4F1A;&#x8C03;&#x7528;&#x6821;&#x9A8C;&#x65B9;&#x6CD5;&#x8FDB;&#x884C;&#x6821;&#x9A8C;&#xFF0C;&#x4EE5;&#x4FDD;&#x8BC1;&#x7528;&#x6237;&#x4E0D;&#x4F1A;&#x7ED9;&#x914D;&#x7F6E;&#x9879;&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;&#x975E;&#x6CD5;&#x7684;&#x503C;&#x3002;</p>
</li>
</ol>
<p>&#x4E00;&#x4E2A;&#x914D;&#x7F6E;&#x6A21;&#x5757;&#x5E94;&#x5177;&#x5907;&#x7684;&#x57FA;&#x672C;&#x529F;&#x80FD;&#xFF1A;</p>
<ol>
<li><p>&#x652F;&#x6301;&#x5B9A;&#x4E49;/&#x58F0;&#x660E;&#x914D;&#x7F6E;&#x9879;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5728;&#x63D0;&#x4F9B;&#x914D;&#x7F6E;&#x540D;&#x79F0;&#x3001;&#x7C7B;&#x578B;&#x4EE5;&#x53CA;&#x53EF;&#x9009;&#x7684;&#x9ED8;&#x8BA4;&#x503C;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x53EF;&#x7528;&#x7684;&#x914D;&#x7F6E;&#x9879;&#x3002;&#x7531;&#x4E8E;&#x4E00;&#x9879;&#x914D;&#x7F6E;&#x53EF;&#x80FD;&#x5728;&#x591A;&#x4E2A;&#x6E90;&#x6587;&#x4EF6;&#x4E2D;&#x4F7F;&#x7528;&#xFF0C;&#x6240;&#x4EE5;&#x914D;&#x7F6E;&#x6A21;&#x5757;&#x8FD8;&#x5E94;&#x8BE5;&#x652F;&#x6301;&#x8DE8;&#x6587;&#x4EF6;&#x58F0;&#x660E;&#x914D;&#x7F6E;&#x9879;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
</li>
<li><p>&#x652F;&#x6301;&#x66F4;&#x65B0;&#x914D;&#x7F6E;&#x9879;&#x7684;&#x503C;&#x3002;&#x8FD9;&#x70B9;&#x5F88;&#x597D;&#x7406;&#x89E3;&#xFF0C;&#x914D;&#x7F6E;&#x9879;&#x521A;&#x88AB;&#x5B9A;&#x4E49;&#x65F6;&#x53EF;&#x80FD;&#x6709;&#x4E00;&#x4E2A;&#x521D;&#x59CB;&#x9ED8;&#x8BA4;&#x503C;&#xFF0C;&#x4F46;&#x7528;&#x6237;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x65B0;&#x7684;&#x503C;&#x6765;&#x8986;&#x76D6;&#x6389;&#x539F;&#x6765;&#x7684;&#x503C;&#x3002;</p>
</li>
<li><p>&#x652F;&#x6301;&#x4ECE;&#x9884;&#x7F6E;&#x7684;&#x9014;&#x5F84;&#x4E2D;&#x52A0;&#x8F7D;&#x914D;&#x7F6E;&#x9879;&#xFF0C;&#x4E00;&#x822C;&#x662F;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x547D;&#x4EE4;&#x884C;&#x53C2;&#x6570;&#xFF0C;&#x6216;&#x662F;&#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x5668;&#x3002;&#x8FD9;&#x91CC;&#x4E0D;&#x4EC5;&#x5E94;&#x8BE5;&#x652F;&#x6301;&#x57FA;&#x672C;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x7684;&#x52A0;&#x8F7D;&#xFF0C;&#x4E5F;&#x5E94;&#x8BE5;&#x652F;&#x6301;&#x590D;&#x6742;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x7684;&#x52A0;&#x8F7D;&#xFF0C;&#x6BD4;&#x5982;&#x76F4;&#x63A5;&#x4ECE;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x4E2D;&#x52A0;&#x8F7D;&#x4E00;&#x4E2A;map&#x7C7B;&#x578B;&#x7684;&#x914D;&#x7F6E;&#x9879;&#xFF0C;&#x6216;&#x662F;&#x76F4;&#x63A5;&#x4ECE;&#x4E00;&#x4E2A;&#x9884;&#x5B9A;&#x683C;&#x5F0F;&#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x4E2D;&#x52A0;&#x8F7D;&#x4E00;&#x4E2A;&#x81EA;&#x5B9A;&#x4E49;&#x7ED3;&#x6784;&#x4F53;&#x3002;</p>
</li>
<li><p>&#x652F;&#x6301;&#x7ED9;&#x914D;&#x7F6E;&#x9879;&#x6CE8;&#x518C;&#x914D;&#x7F6E;&#x53D8;&#x66F4;&#x901A;&#x77E5;&#x3002;&#x914D;&#x7F6E;&#x6A21;&#x5757;&#x5E94;&#x8BE5;&#x63D0;&#x4F9B;&#x65B9;&#x6CD5;&#x8BA9;&#x7A0B;&#x5E8F;&#x77E5;&#x9053;&#x67D0;&#x9879;&#x914D;&#x7F6E;&#x88AB;&#x4FEE;&#x6539;&#x4E86;&#xFF0C;&#x4EE5;&#x4FBF;&#x4E8E;&#x8FDB;&#x884C;&#x4E00;&#x4E9B;&#x64CD;&#x4F5C;&#x3002;&#x6BD4;&#x5982;&#x5BF9;&#x4E8E;&#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x5668;&#x800C;&#x8A00;&#xFF0C;&#x5982;&#x679C;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x53E3;&#x914D;&#x7F6E;&#x53D8;&#x5316;&#x4E86;&#xFF0C;&#x90A3;&#x7A0B;&#x5E8F;&#x5E94;&#x8BE5;&#x91CD;&#x65B0;&#x8D77;&#x76D1;&#x542C;&#x7AEF;&#x53E3;&#x3002;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#x4E00;&#x822C;&#x662F;&#x901A;&#x8FC7;&#x6CE8;&#x518C;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x6765;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x914D;&#x7F6E;&#x4F7F;&#x7528;&#x65B9;&#x9884;&#x5148;&#x7ED9;&#x914D;&#x7F6E;&#x9879;&#x6CE8;&#x518C;&#x4E00;&#x4E2A;&#x914D;&#x7F6E;&#x53D8;&#x66F4;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#xFF0C;&#x914D;&#x7F6E;&#x9879;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x65F6;&#xFF0C;&#x89E6;&#x53D1;&#x5BF9;&#x5E94;&#x7684;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x4EE5;&#x901A;&#x77E5;&#x8C03;&#x7528;&#x65B9;&#x3002;&#x7531;&#x4E8E;&#x4E00;&#x9879;&#x914D;&#x7F6E;&#x53EF;&#x80FD;&#x5728;&#x591A;&#x4E2A;&#x5730;&#x65B9;&#x5F15;&#x7528;&#xFF0C;&#x6240;&#x4EE5;&#x914D;&#x7F6E;&#x53D8;&#x66F4;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x5E94;&#x8BE5;&#x662F;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#x7684;&#x5F62;&#x5F0F;&#x3002;</p>
</li>
<li><p>&#x652F;&#x6301;&#x7ED9;&#x914D;&#x7F6E;&#x9879;&#x8BBE;&#x7F6E;&#x6821;&#x9A8C;&#x65B9;&#x6CD5;&#x3002;&#x914D;&#x7F6E;&#x9879;&#x5728;&#x5B9A;&#x4E49;&#x65F6;&#x4E5F;&#x53EF;&#x4EE5;&#x6307;&#x5B9A;&#x4E00;&#x4E2A;&#x6821;&#x9A8C;&#x65B9;&#x6CD5;&#xFF0C;&#x4EE5;&#x4FDD;&#x8BC1;&#x8BE5;&#x9879;&#x914D;&#x7F6E;&#x4E0D;&#x4F1A;&#x88AB;&#x8BBE;&#x7F6E;&#x6210;&#x4E00;&#x4E2A;&#x975E;&#x6CD5;&#x7684;&#x503C;&#xFF0C;&#x6BD4;&#x5982;&#x5BF9;&#x4E8E;&#x6587;&#x4EF6;&#x8DEF;&#x5F84;&#x7C7B;&#x7684;&#x914D;&#x7F6E;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6821;&#x9A8C;&#x65B9;&#x6CD5;&#x6765;&#x786E;&#x4FDD;&#x8BE5;&#x8DEF;&#x5F84;&#x4E00;&#x5B9A;&#x5B58;&#x5728;&#x3002;</p>
</li>
<li><p>&#x652F;&#x6301;&#x5BFC;&#x51FA;&#x5F53;&#x524D;&#x914D;&#x7F6E;&#x3002;</p>
</li>
</ol>
<h2 id="2-&#x6A21;&#x5757;&#x5B9E;&#x73B0;">2. &#x6A21;&#x5757;&#x5B9E;&#x73B0;</h2>
<h3 id="21-configvarbase">2.1 ConfigVarBase</h3>
<blockquote>
<p>&#x914D;&#x7F6E;&#x9879;&#x57FA;&#x7C7B;</p>
</blockquote>
<p>&#x6BCF;&#x4E2A;&#x914D;&#x7F6E;&#x9879;&#x90FD;&#x5305;&#x62EC;<code>name</code>&#x548C;<code>description</code>&#xFF0C;&#x4EE5;&#x53CA;<code>toString()</code>&#x548C;<code>fromString()</code>&#x4E24;&#x4E2A;&#x7EAF;&#x865A;&#x51FD;&#x6570;&#xFF0C;&#x7528;&#x4E8E;&#x548C;YAML&#x5B57;&#x7B26;&#x4E32;&#x8FDB;&#x884C;&#x76F8;&#x4E92;&#x8F6C;&#x6362;&#x3002;&#x4F46;&#x5E76;&#x4E0D;&#x5305;&#x62EC;&#x914D;&#x7F6E;&#x9879;&#x7C7B;&#x578B;&#x548C;&#x503C;&#xFF0C;&#x7531;&#x7EE7;&#x627F;&#x7C7B;&#x5B9E;&#x73B0;&#x3002;</p>
<p>&#x4E0D;&#x533A;&#x5206;&#x5927;&#x5C0F;&#x5199;&#xFF0C;&#x5168;&#x90E8;&#x7528;<code>transform()</code>&#x8F6C;&#x6210;&#x5C0F;&#x5199;&#x8FDB;&#x884C;&#x914D;&#x7F6E;&#x3002;</p>
<h3 id="22-configvar">2.2 ConfigVar</h3>
<blockquote>
<p>&#x914D;&#x7F6E;&#x53C2;&#x6570;&#x7C7B;&#xFF08;&#x7EE7;&#x627F;ConfigVarBase&#xFF09;</p>
</blockquote>
<h4 id="221-&#x5B9A;&#x4E49;&#x6210;&#x6A21;&#x7248;&#x7C7B;">2.2.1 &#x5B9A;&#x4E49;&#x6210;&#x6A21;&#x7248;&#x7C7B;</h4>
<p><code>template &lt;class T, class FromStr = LexicalCast&lt;std::string, T&gt; , class ToStr = LexicalCast&lt;T, std::string&gt; &gt;</code></p>
<p><code>T</code>&#x4E3A;&#x914D;&#x7F6E;&#x9879;&#x7684;&#x7C7B;&#x578B;&#xFF0C;<code>FromStr()</code>&#x548C;<code>ToStr()</code>&#x7528;&#x4E8E;YAML&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x8F6C;&#x6362;&#xFF0C;&#x5E76;&#x6839;&#x636E;&#x4E0D;&#x540C;&#x7684;<code>T</code>&#x5B9E;&#x73B0;&#x4E0D;&#x540C;&#x7684;&#x7247;&#x7279;&#x5316;&#x3002;</p>
<h4 id="222-&#x652F;&#x6301;&#x53D8;&#x66F4;&#x914D;&#x7F6E;">2.2.2 &#x652F;&#x6301;&#x53D8;&#x66F4;&#x914D;&#x7F6E;</h4>
<p><code>setValue/getValue</code>&#x65B9;&#x6CD5;&#x7528;&#x4E8E;&#x83B7;&#x53D6;/&#x66F4;&#x65B0;&#x914D;&#x7F6E;&#x503C;&#xFF08;&#x66F4;&#x65B0;&#x914D;&#x7F6E;&#x65F6;&#x4F1A;&#x4E00;&#x5E76;&#x89E6;&#x53D1;&#x5168;&#x90E8;&#x7684;&#x914D;&#x7F6E;&#x53D8;&#x66F4;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#xFF09;\
<code>addListener/delListener</code>&#x65B9;&#x6CD5;&#x7528;&#x4E8E;&#x6DFB;&#x52A0;&#x6216;&#x5220;&#x9664;&#x914D;&#x7F6E;&#x53D8;&#x66F4;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x3002;</p>
<h3 id="23-config">2.3 Config</h3>
<blockquote>
<p>&#x914D;&#x7F6E;&#x7BA1;&#x7406;&#x7C7B;</p>
</blockquote>
<p>&#x8D1F;&#x8D23;&#x6258;&#x7BA1;ConfigVar&#x5BF9;&#x8C61;&#x3002;</p>
<p>&#x6240;&#x6709;&#x6210;&#x5458;&#x90FD;&#x4E3A;<code>static</code>&#xFF0C;&#x4FDD;&#x8BC1;&#x5168;&#x5C40;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x5B9E;&#x4F8B;&#x3002;</p>
<h4 id="231-lookup">2.3.1 Lookup</h4>
<blockquote>
<p>&#x7528;&#x4E8E;&#x6839;&#x636E;&#x914D;&#x7F6E;&#x540D;&#x79F0;&#x67E5;&#x8BE2;&#x914D;&#x7F6E;&#x9879;&#x3002;</p>
</blockquote>
<p>&#x5982;&#x679C;&#x8C03;&#x7528;Lookup&#x67E5;&#x8BE2;&#x65F6;&#x540C;&#x65F6;&#x63D0;&#x4F9B;&#x4E86;&#x9ED8;&#x8BA4;&#x503C;&#x548C;&#x914D;&#x7F6E;&#x9879;&#x7684;&#x63CF;&#x8FF0;&#x4FE1;&#x606F;&#xFF0C;&#x90A3;&#x4E48;&#x5728;&#x672A;&#x627E;&#x5230;&#x5BF9;&#x5E94;&#x7684;&#x914D;&#x7F6E;&#x65F6;&#xFF0C;&#x4F1A;&#x81EA;&#x52A8;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5BF9;&#x5E94;&#x7684;&#x914D;&#x7F6E;&#x9879;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x4FDD;&#x8BC1;&#x4E86;&#x914D;&#x7F6E;&#x6A21;&#x5757;&#x5B9A;&#x4E49;&#x5373;&#x53EF;&#x7528;&#x7684;&#x7279;&#x6027;&#x3002;</p>
<h4 id="232-loadfromyaml">2.3.2 LoadFromYaml</h4>
<blockquote>
<p>&#x4ECE;YAML&#x5BF9;&#x8C61;&#x52A0;&#x8F7D;&#x914D;&#x7F6E;&#x3002;</p>
</blockquote>
<h3 id="24-yaml-cpp">2.4 yaml-cpp</h3>
<p>&#x9879;&#x76EE;&#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x91C7;&#x7528;yml&#xFF0C;&#x5E76;&#x7528;yaml-cpp&#x5E93;&#x8FDB;&#x884C;&#x89E3;&#x6790;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x6BCF;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x914D;&#x7F6E;&#xFF0C;&#x5728;&#x5BF9;&#x5E94;&#x7684;<code>ConfigVar</code>&#x6A21;&#x7248;&#x7C7B;&#x5B9E;&#x4F8B;&#x5316;&#x65F6;&#x90FD;&#x8981;&#x63D0;&#x4F9B;<code>FromStr</code>&#x548C;<code>ToStr</code>&#x4E24;&#x4E2A;&#x4EFF;&#x51FD;&#x6570;&#xFF0C;&#x7528;&#x4E8E;&#x5B9E;&#x73B0;&#x8BE5;&#x7C7B;&#x578B;&#x548C;YAML&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x76F8;&#x4E92;&#x8F6C;&#x6362;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x6BCF;&#x79CD;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF0C;&#x5305;&#x62EC;&#x81EA;&#x5B9A;&#x4E49;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF0C;&#x90FD;&#x9700;&#x8981;&#x7247;&#x7279;&#x5316;&#x3002;&#x4ECE;&#x4E00;&#x4E2A;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x7684;&#x8F6C;&#x6362;&#x7C7B;&#x5F00;&#x59CB;&#xFF0C;&#x7279;&#x5316;&#x51FA;&#x5176;&#x4ED6;&#x7C7B;&#x578B;&#x7684;&#x8F6C;&#x6362;&#x7C7B;&#x3002;</p>
<pre><code class="lang-C++"><span class="hljs-keyword">template</span>&lt;<span class="hljs-keyword">class</span> F, <span class="hljs-keyword">class</span> T&gt;
<span class="hljs-keyword">class</span> LexicalCast {
<span class="hljs-keyword">public</span>:
    <span class="hljs-comment">/**
     * @brief &#x7C7B;&#x578B;&#x8F6C;&#x6362;
     * @param[in] v &#x6E90;&#x7C7B;&#x578B;&#x503C;
     * @return &#x8FD4;&#x56DE;v&#x8F6C;&#x6362;&#x540E;&#x7684;&#x76EE;&#x6807;&#x7C7B;&#x578B;
     * @exception &#x5F53;&#x7C7B;&#x578B;&#x4E0D;&#x53EF;&#x8F6C;&#x6362;&#x65F6;&#x629B;&#x51FA;&#x5F02;&#x5E38;
     */</span>
    <span class="hljs-function">T <span class="hljs-title">operator</span><span class="hljs-params">()</span><span class="hljs-params">(<span class="hljs-keyword">const</span> F&amp; v)</span> </span>{
        <span class="hljs-keyword">return</span> boost::lexical_cast&lt;T&gt;(v);
    }
};
</code></pre>
<p>&#x5B9E;&#x73B0;&#x4E86;<code>int</code>&#x3001;<code>vector</code>&#x3001;<code>set</code>&#x3001;<code>map</code>&#x7B49;&#x7C7B;&#x578B;&#xFF0C;&#x6839;&#x636E;&#x8FD9;&#x4E9B;&#x7C7B;&#x578B;&#x7684;&#x642D;&#x914D;&#xFF0C;&#x8FD8;&#x5B9E;&#x73B0;&#x5176;&#x4ED6;&#x590D;&#x6742;&#x7C7B;&#x578B;&#xFF0C;&#x4F8B;&#x5982;<code>vector&lt;set&gt;</code>&#x3001;<code>set&lt;vector&gt;</code>&#x7B49;&#x7B49;&#x3002;</p>
<h3 id="25-usage">2.5 Usage</h3>
<pre><code class="lang-bash">YAML::Node root = YAML::LoadFile(<span class="hljs-string">&quot;url/*.yml&quot;</span>);
jujimeizuo::Config::LoadFromYaml(root);
</code></pre>
<h4 id="251-unorderedmap&#x505A;&#x914D;&#x7F6E;">2.5.1 unordered_map&#x505A;&#x914D;&#x7F6E;</h4>
<pre><code class="lang-C++">jujimeizuo::ConfigVar&lt;<span class="hljs-built_in">std</span>::<span class="hljs-built_in">unordered_map</span>&lt;<span class="hljs-built_in">std</span>::<span class="hljs-built_in">string</span>, <span class="hljs-keyword">int</span>&gt; &gt;::ptr g_str_int_unordered_map_value_config =
    jujimeizuo::Config::Lookup(<span class="hljs-string">&quot;system.str_int_unordered_map&quot;</span>, <span class="hljs-built_in">std</span>::<span class="hljs-built_in">unordered_map</span>&lt;<span class="hljs-built_in">std</span>::<span class="hljs-built_in">string</span>, <span class="hljs-keyword">int</span>&gt;{{<span class="hljs-string">&quot;k&quot;</span>, <span class="hljs-number">2</span>}}, <span class="hljs-string">&quot;system str int unordered_map&quot;</span>);
</code></pre>
<pre><code class="lang-bash">2022-09-01 00:03:24     4294967295      0       [INFO]  [root]  /Users/fengzetao/Desktop/WebServer/tests/<span class="hljs-built_in">test</span>_config.cc:142     after str_int_unordered_map: {k2 - 20}
</code></pre>
<h2 id="3-&#x603B;&#x7ED3;">3. &#x603B;&#x7ED3;</h2>
<p>&#x91C7;&#x7528;&#x7EA6;&#x5B9A;&#x7531;&#x4E8E;&#x914D;&#x7F6E;&#x7684;&#x601D;&#x60F3;&#x3002;&#x5B9A;&#x4E49;&#x5373;&#x53EF;&#x4F7F;&#x7528;&#x3002;&#x4E0D;&#x9700;&#x8981;&#x5355;&#x72EC;&#x53BB;&#x89E3;&#x6790;&#x3002;&#x652F;&#x6301;&#x53D8;&#x66F4;&#x901A;&#x77E5;&#x529F;&#x80FD;&#x3002;&#x4F7F;&#x7528;YAML&#x6587;&#x4EF6;&#x505A;&#x4E3A;&#x914D;&#x7F6E;&#x5185;&#x5BB9;&#x3002;&#x652F;&#x6301;&#x7EA7;&#x522B;&#x683C;&#x5F0F;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF0C;&#x652F;&#x6301;STL&#x5BB9;&#x5668;(vector,list,set,map&#x7B49;&#x7B49;),&#x652F;&#x6301;&#x81EA;&#x5B9A;&#x4E49;&#x7C7B;&#x578B;&#x7684;&#x652F;&#x6301;&#xFF08;&#x9700;&#x8981;&#x5B9E;&#x73B0;&#x5E8F;&#x5217;&#x5316;&#x548C;&#x53CD;&#x5E8F;&#x5217;&#x5316;&#x65B9;&#x6CD5;)&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x914D;&#x7F6E;&#x7CFB;&#x7EDF;&#x5BF9;&#x65E5;&#x5FD7;&#x8FDB;&#x884C;&#x914D;&#x7F6E;&#x9700;&#x8981;&#x5BF9;&#x65E5;&#x5FD7;&#x91CC;&#x7684;&#x7C7B;&#x578B;&#x8FDB;&#x884C;&#x7247;&#x7279;&#x5316;&#x5904;&#x7406;&#xFF0C;&#x8FD9;&#x6837;&#x5728;&#x5904;&#x7406;&#x5E8F;&#x5217;&#x5316;&#x4E0E;&#x53CD;&#x5E8F;&#x5217;&#x5316;&#x7684;&#x65F6;&#x5019;&#x624D;&#x80FD;&#x8BC6;&#x522B;yml&#x6587;&#x4EF6;&#x4E2D;&#x7684;log&#x914D;&#x7F6E;&#x3002;&#x5177;&#x4F53;&#x5728;<code>LogDefine</code>&#x548C;<code>LogAppenderDefine</code>&#x3002;</p>

                        
                    </section>
                    
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                </div>
            </div>
            
        </div>

        
        
        <a href="../Env/"
           class="navigation navigation-prev "
           aria-label="Previous page: 环境变量模块">
            <i class="fa fa-angle-left"></i>
        </a>
        
        
        <a href="../Thread/"
           class="navigation navigation-next "
           aria-label="Next page: 线程模块">
            <i class="fa fa-angle-right"></i>
        </a>
        
        
        
    </div>
    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"配置模块","level":"1.4.3","depth":2,"next":{"title":"线程模块","level":"1.4.4","depth":2,"path":"server/Thread/README.md","ref":"server/Thread/README.md","articles":[]},"previous":{"title":"环境变量模块","level":"1.4.2","depth":2,"path":"server/Env/README.md","ref":"server/Env/README.md","articles":[]},"dir":"ltr"},"config":{"plugins":["insert-logo","favicon","-lunr","-search","search-pro","splitter","github","-copy-code-button","code","chapter-fold","theme-hqbook","livereload"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"chapter-fold":{},"github":{"url":"https://github.com/JUHPS"},"livereload":{},"splitter":{},"search-pro":{},"code":{"copyButtons":true},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"favicon":{"shortcut":"/img/favicon.png","bookmark":"/img/favicon.png","appleTouch":"/img/favicon.png","appleTouchMore":{"120x120":"/img/favicon.png","180x180":"/img/favicon.png"}},"theme-hqbook":{"copyButtons":true,"copyLines":true,"dragSplitter":false,"favicon":"https://github.com/JUHPS/juhps-docs/blob/master/img/favicon.png?raw=true","flexible-linkcard":{"hrefUrl":"https://github.com/JUHPS/juhps-docs/","imgClass":"rect","imgSrc":"https://github.com/JUHPS/juhps-docs/blob/master/img/favicon.png?raw=true","target":"_blank","title":"flexible-linkcard"},"logo":"https://github.com/JUHPS/juhps-docs/blob/master/img/favicon.png?raw=true","search-placeholder":"输入关键字搜索","hide-elements":[".summary .gitbook-link"]},"sharing":{"facebook":false,"twitter":false,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"insert-logo":{"style":"background: none; max-height: 100px; min-height: 30px","url":"https://github.com/JUHPS/juhps-docs/blob/master/img/favicon.png?raw=true"}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{"themeHqbook":{"nav":[{}]}},"title":"High Performance Web Server manual","links":{"sidebar":{"GitHub":"http://github.com/JUHPS"},"sharing":{"google":false,"facebook":false,"twitter":false,"weibo":false,"all":null}},"gitbook":"*","description":"The manual of High Performance Web Server"},"file":{"path":"server/Config/README.md","mtime":"2023-01-27T13:15:49.434Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2023-04-10T16:05:15.677Z"},"basePath":"../..","book":{"language":""}})
        });
    </script>
</div>

        
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="../../gitbook/gitbook-plugin-insert-logo/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-code/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-chapter-fold/chapter-fold.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-theme-hqbook/theme.js"></script>
        
    

    </body>
</html>

