
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>协程调度模块 · High Performance Web Server manual</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-insert-logo/plugin.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-code/plugin.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-chapter-fold/chapter-fold.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-theme-hqbook/theme.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../IOManager/" />
    
    
    <link rel="prev" href="../Fiber/" />
    

    
        <link rel="shortcut icon" href='../../img/favicon.png' type="image/x-icon">
    
    
        <link rel="bookmark" href='../../img/favicon.png' type="image/x-icon">
    
    
        <link rel="apple-touch-icon" href='../../img/favicon.png'>
    
    
        
        <link rel="apple-touch-icon" sizes="120x120" href="../../img/favicon.png">
        
        <link rel="apple-touch-icon" sizes="180x180" href="../../img/favicon.png">
        
    

    </head>
    <body>
        
<div class="book">
    <div class="header-inner">
        <!-- LOGO -->
        <div class="logo">
            <img src="" alt="logo">
        </div>
        <span class="title"></span>

        <!-- Search -->
        
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>


        <!-- Nav -->
        <ul class="header-nav">
            <li>
                <a href="" target=""></a>
            </li>
        </ul>
    </div>

    <div class="book-summary">
        <!--<div class="book-summary-title">文档目录</div>-->
        
        
        <nav role="navigation">
            


<ul class="summary">
    
    
    
        
        <li>
            <a href="http://github.com/JUHPS" target="_blank" class="custom-link">GitHub</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    首页
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../../Welcome.html">
            
                <a href="../../Welcome.html">
            
                    
                    介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../../getStarted/">
            
                <a href="../../getStarted/">
            
                    
                    开始部署
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../../getStarted/common/Prepare.html">
            
                <a href="../../getStarted/common/Prepare.html">
            
                    
                    准备工作
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../../getStarted/common/StartJUHPS.html">
            
                <a href="../../getStarted/common/StartJUHPS.html">
            
                    
                    启动系统
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../">
            
                <a href="../">
            
                    
                    服务器
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../Logger/">
            
                <a href="../Logger/">
            
                    
                    日志模块
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="../Env/">
            
                <a href="../Env/">
            
                    
                    环境变量模块
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="../Config/">
            
                <a href="../Config/">
            
                    
                    配置模块
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.4" data-path="../Thread/">
            
                <a href="../Thread/">
            
                    
                    线程模块
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.5" data-path="../Fiber/">
            
                <a href="../Fiber/">
            
                    
                    协程模块
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4.6" data-path="./">
            
                <a href="./">
            
                    
                    协程调度模块
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.7" data-path="../IOManager/">
            
                <a href="../IOManager/">
            
                    
                    IO协程调度模块
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.8" data-path="../Timer/">
            
                <a href="../Timer/">
            
                    
                    定时器模块
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.9" data-path="../Hook/">
            
                <a href="../Hook/">
            
                    
                    Hook模块
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.10" data-path="../Address/">
            
                <a href="../Address/">
            
                    
                    网络地址模块
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.11" data-path="../Socket/">
            
                <a href="../Socket/">
            
                    
                    Socket模块
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.12" data-path="../ByteArray/">
            
                <a href="../ByteArray/">
            
                    
                    ByteArray序列化模块
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.13" data-path="../Stream/">
            
                <a href="../Stream/">
            
                    
                    字节流序列化模块
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.14" data-path="../TcpServer/">
            
                <a href="../TcpServer/">
            
                    
                    TcpServer模块
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


        </nav>
        
        
    </div>

    <!-- Content nav -->
    <div class="book-anchor">
        <!--<div class="book-anchor-title">在这篇文章中:</div>-->
        <div class="book-anchor-body">

        </div>
    </div>

    <div class="book-body">
        
        <div class="body-inner">
            
            

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >协程调度模块</a>
    </h1>
</div>




            <div class="page-wrapper" tabindex="-1" role="main">
                <div class="page-inner">
                    
<div id="book-search-results">
    <div class="search-noresults">
    
                    <section class="normal markdown-section">
                        
                        <h1 id="&#x7EBF;&#x7A0B;&#x8C03;&#x5EA6;&#x6A21;&#x5757;">&#x7EBF;&#x7A0B;&#x8C03;&#x5EA6;&#x6A21;&#x5757;</h1>
<blockquote>
<p>&#x5B9E;&#x73B0;&#x4E86;&#x4E00;&#x4E2A;N-M&#x7684;&#x534F;&#x7A0B;&#x8C03;&#x5EA6;&#x5668;&#xFF0C;N&#x4E2A;&#x7EBF;&#x7A0B;&#x8FD0;&#x884C;M&#x4E2A;&#x534F;&#x7A0B;&#xFF0C;&#x534F;&#x7A0B;&#x53EF;&#x4EE5;&#x5728;&#x7EBF;&#x7A0B;&#x4E4B;&#x95F4;&#x8FDB;&#x884C;&#x5207;&#x6362;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x7ED1;&#x5B9A;&#x5230;&#x6307;&#x5B9A;&#x7EBF;&#x7A0B;&#x8FD0;&#x884C;&#x3002;</p>
</blockquote>
<p>&#x5B9E;&#x73B0;&#x534F;&#x7A0B;&#x8C03;&#x5EA6;&#x4E4B;&#x540E;&#xFF0C;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x534F;&#x7A0B;&#x6A21;&#x5757;&#x4E2D;&#x5B50;&#x534F;&#x7A0B;&#x4E0D;&#x80FD;&#x8FD0;&#x884C;&#x53E6;&#x4E00;&#x4E2A;&#x5B50;&#x534F;&#x7A0B;&#x7684;&#x7F3A;&#x9677;&#xFF0C;&#x5B50;&#x534F;&#x7A0B;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5411;&#x8C03;&#x5EA6;&#x5668;&#x6DFB;&#x52A0;&#x8C03;&#x5EA6;&#x4EFB;&#x52A1;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x8FD0;&#x884C;&#x53E6;&#x4E00;&#x4E2A;&#x5B50;&#x534F;&#x7A0B;&#x3002;</p>
<h2 id="1-&#x6A21;&#x5757;&#x8BBE;&#x8BA1;">1. &#x6A21;&#x5757;&#x8BBE;&#x8BA1;</h2>
<p>&#x8C03;&#x5EA6;&#x5668;&#x5185;&#x90E8;&#x7EF4;&#x62A4;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x548C;&#x4E00;&#x4E2A;&#x8C03;&#x5EA6;&#x7EBF;&#x7A0B;&#x6C60;&#x3002;&#x5F00;&#x59CB;&#x8C03;&#x5EA6;&#x540E;&#xFF0C;&#x7EBF;&#x7A0B;&#x6C60;&#x4ECE;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x91CC;&#x6309;&#x987A;&#x5E8F;&#x53D6;&#x4EFB;&#x52A1;&#x6267;&#x884C;&#x3002;&#x8C03;&#x5EA6;&#x7EBF;&#x7A0B;&#x53EF;&#x4EE5;&#x5305;&#x542B;caller&#x7EBF;&#x7A0B;&#x3002;&#x5F53;&#x5168;&#x90E8;&#x4EFB;&#x52A1;&#x90FD;&#x6267;&#x884C;&#x5B8C;&#x4E86;&#xFF0C;&#x7EBF;&#x7A0B;&#x6C60;&#x505C;&#x6B62;&#x8C03;&#x5EA6;&#xFF0C;&#x7B49;&#x65B0;&#x7684;&#x4EFB;&#x52A1;&#x8FDB;&#x6765;&#x3002;&#x6DFB;&#x52A0;&#x65B0;&#x4EFB;&#x52A1;&#x540E;&#xFF0C;&#x901A;&#x77E5;&#x7EBF;&#x7A0B;&#x6C60;&#x6709;&#x65B0;&#x7684;&#x4EFB;&#x52A1;&#x8FDB;&#x6765;&#x4E86;&#xFF0C;&#x7EBF;&#x7A0B;&#x6C60;&#x91CD;&#x65B0;&#x5F00;&#x59CB;&#x8FD0;&#x884C;&#x8C03;&#x5EA6;&#x3002;&#x505C;&#x6B62;&#x8C03;&#x5EA6;&#x65F6;&#xFF0C;&#x5404;&#x8C03;&#x5EA6;&#x7EBF;&#x7A0B;&#x9000;&#x51FA;&#xFF0C;&#x8C03;&#x5EA6;&#x5668;&#x505C;&#x6B62;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x534F;&#x7A0B;&#x8C03;&#x5EA6;&#x6A21;&#x5757;&#x652F;&#x6301;&#x591A;&#x7EBF;&#x7A0B;&#xFF0C;&#x652F;&#x6301;&#x4F7F;&#x7528;caller&#x7EBF;&#x7A0B;&#x8FDB;&#x884C;&#x8C03;&#x5EA6;&#xFF0C;&#x652F;&#x6301;&#x6DFB;&#x52A0;&#x51FD;&#x6570;&#x6216;&#x534F;&#x7A0B;&#x4F5C;&#x4E3A;&#x8C03;&#x5EA6;&#x5BF9;&#x8C61;&#xFF0C;&#x5E76;&#x4E14;&#x652F;&#x6301;&#x5C06;&#x51FD;&#x6570;&#x6216;&#x534F;&#x7A0B;&#x7ED1;&#x5B9A;&#x5230;&#x4E00;&#x4E2A;&#x5177;&#x4F53;&#x7684;&#x7EBF;&#x7A0B;&#x4E0A;&#x6267;&#x884C;&#x3002;</p>
<p>&#x9996;&#x5148;&#x662F;&#x534F;&#x7A0B;&#x8C03;&#x5EA6;&#x5668;&#x7684;&#x521D;&#x59CB;&#x5316;&#x3002;&#x534F;&#x7A0B;&#x8C03;&#x5EA6;&#x5668;&#x5728;&#x521D;&#x59CB;&#x5316;&#x65F6;&#x652F;&#x6301;&#x4F20;&#x5165;&#x7EBF;&#x7A0B;&#x6570;&#x548C;&#x4E00;&#x4E2A;&#x5E03;&#x5C14;&#x578B;&#x7684;use_caller&#x53C2;&#x6570;&#xFF0C;&#x8868;&#x793A;&#x662F;&#x5426;&#x4F7F;&#x7528;caller&#x7EBF;&#x7A0B;&#x3002;&#x5728;&#x4F7F;&#x7528;caller&#x7EBF;&#x7A0B;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7EBF;&#x7A0B;&#x6570;&#x81EA;&#x52A8;&#x51CF;&#x4E00;&#xFF0C;&#x5E76;&#x4E14;&#x8C03;&#x5EA6;&#x5668;&#x5185;&#x90E8;&#x4F1A;&#x521D;&#x59CB;&#x5316;&#x4E00;&#x4E2A;&#x5C5E;&#x4E8E;caller&#x7EBF;&#x7A0B;&#x7684;&#x8C03;&#x5EA6;&#x534F;&#x7A0B;&#x5E76;&#x4FDD;&#x5B58;&#x8D77;&#x6765;&#xFF08;&#x6BD4;&#x5982;&#xFF0C;&#x5728;main&#x51FD;&#x6570;&#x4E2D;&#x521B;&#x5EFA;&#x7684;&#x8C03;&#x5EA6;&#x5668;&#xFF0C;&#x5982;&#x679C;use_caller&#x4E3A;true&#xFF0C;&#x90A3;&#x8C03;&#x5EA6;&#x5668;&#x4F1A;&#x521D;&#x59CB;&#x5316;&#x4E00;&#x4E2A;&#x5C5E;&#x4E8E;main&#x51FD;&#x6570;&#x7EBF;&#x7A0B;&#x7684;&#x8C03;&#x5EA6;&#x534F;&#x7A0B;&#xFF09;&#x3002;</p>
<p>&#x8C03;&#x5EA6;&#x5668;&#x521B;&#x5EFA;&#x597D;&#x540E;&#xFF0C;&#x5373;&#x53EF;&#x8C03;&#x7528;&#x8C03;&#x5EA6;&#x5668;&#x7684;schedule&#x65B9;&#x6CD5;&#x5411;&#x8C03;&#x5EA6;&#x5668;&#x6DFB;&#x52A0;&#x8C03;&#x5EA6;&#x4EFB;&#x52A1;&#xFF0C;&#x4F46;&#x6B64;&#x65F6;&#x8C03;&#x5EA6;&#x5668;&#x5E76;&#x4E0D;&#x4F1A;&#x7ACB;&#x523B;&#x6267;&#x884C;&#x8FD9;&#x4E9B;&#x4EFB;&#x52A1;&#xFF0C;&#x800C;&#x662F;&#x5C06;&#x5B83;&#x4EEC;&#x4FDD;&#x5B58;&#x5230;&#x5185;&#x90E8;&#x7684;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x4E2D;&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#x662F;&#x8C03;&#x7528;start&#x65B9;&#x6CD5;&#x542F;&#x52A8;&#x8C03;&#x5EA6;&#x3002;start&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#x540E;&#x4F1A;&#x521B;&#x5EFA;&#x8C03;&#x5EA6;&#x7EBF;&#x7A0B;&#x6C60;&#xFF0C;&#x7EBF;&#x7A0B;&#x6570;&#x91CF;&#x7531;&#x521D;&#x59CB;&#x5316;&#x65F6;&#x7684;&#x7EBF;&#x7A0B;&#x6570;&#x548C;use_caller&#x786E;&#x5B9A;&#x3002;&#x8C03;&#x5EA6;&#x7EBF;&#x7A0B;&#x4E00;&#x65E6;&#x521B;&#x5EFA;&#xFF0C;&#x5C31;&#x4F1A;&#x7ACB;&#x523B;&#x4ECE;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x91CC;&#x53D6;&#x4EFB;&#x52A1;&#x6267;&#x884C;&#x3002;&#x6BD4;&#x8F83;&#x7279;&#x6B8A;&#x7684;&#x4E00;&#x70B9;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x521D;&#x59CB;&#x5316;&#x65F6;&#x6307;&#x5B9A;&#x7EBF;&#x7A0B;&#x6570;&#x4E3A;1&#x4E14;use_caller&#x4E3A;true&#xFF0C;&#x90A3;&#x4E48;start&#x65B9;&#x6CD5;&#x4EC0;&#x4E48;&#x4E5F;&#x4E0D;&#x505A;&#xFF0C;&#x56E0;&#x4E3A;&#x4E0D;&#x9700;&#x8981;&#x521B;&#x5EFA;&#x65B0;&#x7EBF;&#x7A0B;&#x7528;&#x4E8E;&#x8C03;&#x5EA6;&#x3002;&#x5E76;&#x4E14;&#xFF0C;&#x7531;&#x4E8E;&#x6CA1;&#x6709;&#x521B;&#x5EFA;&#x65B0;&#x7684;&#x8C03;&#x5EA6;&#x7EBF;&#x7A0B;&#xFF0C;&#x90A3;&#x53EA;&#x80FD;&#x7531;caller&#x7EBF;&#x7A0B;&#x7684;&#x8C03;&#x5EA6;&#x534F;&#x7A0B;&#x6765;&#x8D1F;&#x8D23;&#x8C03;&#x5EA6;&#x534F;&#x7A0B;&#xFF0C;&#x800C;caller&#x7EBF;&#x7A0B;&#x7684;&#x8C03;&#x5EA6;&#x534F;&#x7A0B;&#x7684;&#x6267;&#x884C;&#x65F6;&#x673A;&#x4E0E;start&#x65B9;&#x6CD5;&#x5E76;&#x4E0D;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#x662F;&#x8C03;&#x5EA6;&#x534F;&#x7A0B;&#xFF0C;&#x5BF9;&#x5E94;run&#x65B9;&#x6CD5;&#x3002;&#x8C03;&#x5EA6;&#x534F;&#x7A0B;&#x8D1F;&#x8D23;&#x4ECE;&#x8C03;&#x5EA6;&#x5668;&#x7684;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x4E2D;&#x53D6;&#x4EFB;&#x52A1;&#x6267;&#x884C;&#x3002;&#x53D6;&#x51FA;&#x7684;&#x4EFB;&#x52A1;&#x5373;&#x5B50;&#x534F;&#x7A0B;&#xFF0C;&#x8FD9;&#x91CC;&#x8C03;&#x5EA6;&#x534F;&#x7A0B;&#x548C;&#x5B50;&#x534F;&#x7A0B;&#x7684;&#x5207;&#x6362;&#x6A21;&#x578B;&#x5373;&#x4E3A;&#x524D;&#x4E00;&#x7AE0;&#x4ECB;&#x7ECD;&#x7684;&#x975E;&#x5BF9;&#x79F0;&#x6A21;&#x578B;&#xFF0C;&#x6BCF;&#x4E2A;&#x5B50;&#x534F;&#x7A0B;&#x6267;&#x884C;&#x5B8C;&#x540E;&#x90FD;&#x5FC5;&#x987B;&#x8FD4;&#x56DE;&#x8C03;&#x5EA6;&#x534F;&#x7A0B;&#xFF0C;&#x7531;&#x8C03;&#x5EA6;&#x534F;&#x7A0B;&#x91CD;&#x65B0;&#x4ECE;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x4E2D;&#x53D6;&#x65B0;&#x7684;&#x534F;&#x7A0B;&#x5E76;&#x6267;&#x884C;&#x3002;&#x5982;&#x679C;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x7A7A;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x8C03;&#x5EA6;&#x534F;&#x7A0B;&#x4F1A;&#x5207;&#x6362;&#x5230;&#x4E00;&#x4E2A;idle&#x534F;&#x7A0B;&#xFF0C;&#x8FD9;&#x4E2A;idle&#x534F;&#x7A0B;&#x4EC0;&#x4E48;&#x4E5F;&#x4E0D;&#x505A;&#xFF0C;&#x7B49;&#x6709;&#x65B0;&#x4EFB;&#x52A1;&#x8FDB;&#x6765;&#x65F6;&#xFF0C;idle&#x534F;&#x7A0B;&#x624D;&#x4F1A;&#x9000;&#x51FA;&#x5E76;&#x56DE;&#x5230;&#x8C03;&#x5EA6;&#x534F;&#x7A0B;&#xFF0C;&#x91CD;&#x65B0;&#x5F00;&#x59CB;&#x4E0B;&#x4E00;&#x8F6E;&#x8C03;&#x5EA6;&#x3002;</p>
<p>&#x5728;&#x975E;caller&#x7EBF;&#x7A0B;&#x91CC;&#xFF0C;&#x8C03;&#x5EA6;&#x534F;&#x7A0B;&#x5C31;&#x662F;&#x8C03;&#x5EA6;&#x7EBF;&#x7A0B;&#x7684;&#x4E3B;&#x7EBF;&#x7A0B;&#xFF0C;&#x4F46;&#x5728;caller&#x7EBF;&#x7A0B;&#x91CC;&#xFF0C;&#x8C03;&#x5EA6;&#x534F;&#x7A0B;&#x5E76;&#x4E0D;&#x662F;caller&#x7EBF;&#x7A0B;&#x7684;&#x4E3B;&#x534F;&#x7A0B;&#xFF0C;&#x800C;&#x662F;&#x76F8;&#x5F53;&#x4E8E;caller&#x7EBF;&#x7A0B;&#x7684;&#x5B50;&#x534F;&#x7A0B;&#xFF0C;&#x8FD9;&#x5728;&#x534F;&#x7A0B;&#x5207;&#x6362;&#x65F6;&#x4F1A;&#x6709;&#x5927;&#x9EBB;&#x70E6;&#xFF08;&#x8FD9;&#x70B9;&#x662F;&#x534F;&#x7A0B;&#x8C03;&#x5EA6;&#x6A21;&#x5757;&#x6700;&#x96BE;&#x7406;&#x89E3;&#x7684;&#x5730;&#x65B9;&#xFF09;&#xFF0C;&#x5982;&#x4F55;&#x5904;&#x7406;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x5C06;&#x5728;&#x4E0B;&#x9762;&#x7684;&#x7AE0;&#x8282;&#x4E13;&#x95E8;&#x8FDB;&#x884C;&#x8BA8;&#x8BBA;&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#x662F;&#x6DFB;&#x52A0;&#x8C03;&#x5EA6;&#x4EFB;&#x52A1;&#xFF0C;&#x5BF9;&#x5E94;schedule&#x65B9;&#x6CD5;&#xFF0C;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x652F;&#x6301;&#x4F20;&#x5165;&#x534F;&#x7A0B;&#x6216;&#x51FD;&#x6570;&#xFF0C;&#x5E76;&#x4E14;&#x652F;&#x6301;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x53F7;&#x53C2;&#x6570;&#xFF0C;&#x8868;&#x793A;&#x662F;&#x5426;&#x5C06;&#x8FD9;&#x4E2A;&#x534F;&#x7A0B;&#x6216;&#x51FD;&#x6570;&#x7ED1;&#x5B9A;&#x5230;&#x4E00;&#x4E2A;&#x5177;&#x4F53;&#x7684;&#x7EBF;&#x7A0B;&#x4E0A;&#x6267;&#x884C;&#x3002;&#x5982;&#x679C;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x4E3A;&#x7A7A;&#xFF0C;&#x90A3;&#x4E48;&#x5728;&#x6DFB;&#x52A0;&#x4EFB;&#x52A1;&#x4E4B;&#x540E;&#xFF0C;&#x8981;&#x8C03;&#x7528;&#x4E00;&#x6B21;tickle&#x65B9;&#x6CD5;&#x4EE5;&#x901A;&#x77E5;&#x5404;&#x8C03;&#x5EA6;&#x7EBF;&#x7A0B;&#x7684;&#x8C03;&#x5EA6;&#x534F;&#x7A0B;&#x6709;&#x65B0;&#x4EFB;&#x52A1;&#x6765;&#x4E86;&#x3002;</p>
<p>&#x5728;&#x6267;&#x884C;&#x8C03;&#x5EA6;&#x4EFB;&#x52A1;&#x65F6;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8C03;&#x5EA6;&#x5668;&#x7684;GetThis()&#x65B9;&#x6CD5;&#x83B7;&#x53D6;&#x5230;&#x5F53;&#x524D;&#x8C03;&#x5EA6;&#x5668;&#xFF0C;&#x518D;&#x901A;&#x8FC7;schedule&#x65B9;&#x6CD5;&#x7EE7;&#x7EED;&#x6DFB;&#x52A0;&#x65B0;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x8FD9;&#x5C31;&#x53D8;&#x76F8;&#x5B9E;&#x73B0;&#x4E86;&#x5728;&#x5B50;&#x534F;&#x7A0B;&#x4E2D;&#x521B;&#x5EFA;&#x5E76;&#x8FD0;&#x884C;&#x65B0;&#x7684;&#x5B50;&#x534F;&#x7A0B;&#x7684;&#x529F;&#x80FD;&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#x662F;&#x8C03;&#x5EA6;&#x5668;&#x7684;&#x505C;&#x6B62;&#x3002;&#x8C03;&#x5EA6;&#x5668;&#x7684;&#x505C;&#x6B62;&#x884C;&#x4E3A;&#x8981;&#x5206;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#x8BA8;&#x8BBA;&#xFF0C;&#x9996;&#x5148;&#x662F;use_caller&#x4E3A;false&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7531;&#x4E8E;&#x6CA1;&#x6709;&#x4F7F;&#x7528;caller&#x7EBF;&#x7A0B;&#x8FDB;&#x884C;&#x8C03;&#x5EA6;&#xFF0C;&#x90A3;&#x4E48;&#x53EA;&#x9700;&#x8981;&#x7B80;&#x5355;&#x5730;&#x7B49;&#x5404;&#x4E2A;&#x8C03;&#x5EA6;&#x7EBF;&#x7A0B;&#x7684;&#x8C03;&#x5EA6;&#x534F;&#x7A0B;&#x9000;&#x51FA;&#x5C31;&#x884C;&#x4E86;&#x3002;&#x5982;&#x679C;use_caller&#x4E3A;true&#xFF0C;&#x8868;&#x793A;caller&#x7EBF;&#x7A0B;&#x4E5F;&#x8981;&#x53C2;&#x4E8E;&#x8C03;&#x5EA6;&#xFF0C;&#x8FD9;&#x65F6;&#xFF0C;&#x8C03;&#x5EA6;&#x5668;&#x521D;&#x59CB;&#x5316;&#x65F6;&#x8BB0;&#x5F55;&#x7684;&#x5C5E;&#x4E8E;caller&#x7EBF;&#x7A0B;&#x7684;&#x8C03;&#x5EA6;&#x534F;&#x7A0B;&#x5C31;&#x8981;&#x8D77;&#x4F5C;&#x7528;&#x4E86;&#xFF0C;&#x5728;&#x8C03;&#x5EA6;&#x5668;&#x505C;&#x6B62;&#x524D;&#xFF0C;&#x5E94;&#x8BE5;&#x8BA9;&#x8FD9;&#x4E2A;caller&#x7EBF;&#x7A0B;&#x7684;&#x8C03;&#x5EA6;&#x534F;&#x7A0B;&#x4E5F;&#x8FD0;&#x884C;&#x4E00;&#x6B21;&#xFF0C;&#x8BA9;caller&#x7EBF;&#x7A0B;&#x5B8C;&#x6210;&#x8C03;&#x5EA6;&#x5DE5;&#x4F5C;&#x540E;&#x518D;&#x9000;&#x51FA;&#x3002;&#x5982;&#x679C;&#x8C03;&#x5EA6;&#x5668;&#x53EA;&#x4F7F;&#x7528;&#x4E86;caller&#x7EBF;&#x7A0B;&#x8FDB;&#x884C;&#x8C03;&#x5EA6;&#xFF0C;&#x90A3;&#x4E48;&#x6240;&#x6709;&#x7684;&#x8C03;&#x5EA6;&#x4EFB;&#x52A1;&#x8981;&#x5728;&#x8C03;&#x5EA6;&#x5668;&#x505C;&#x6B62;&#x65F6;&#x624D;&#x4F1A;&#x88AB;&#x8C03;&#x5EA6;&#x3002;</p>
<h2 id="2-&#x8C03;&#x5EA6;&#x5668;&#x5207;&#x6362;">2. &#x8C03;&#x5EA6;&#x5668;&#x5207;&#x6362;</h2>
<p>&#x8FD9;&#x91CC;&#x5206;&#x4E24;&#x79CD;&#x5178;&#x578B;&#x60C5;&#x51B5;&#x6765;&#x8BA8;&#x8BBA;&#x4E00;&#x4E0B;&#x8C03;&#x5EA6;&#x534F;&#x7A0B;&#x7684;&#x5207;&#x6362;&#x60C5;&#x51B5;&#xFF0C;&#x5176;&#x4ED6;&#x60C5;&#x51B5;&#x53EF;&#x4EE5;&#x770B;&#x6210;&#x4EE5;&#x4E0B;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#x7684;&#x7EC4;&#x5408;&#xFF0C;&#x539F;&#x7406;&#x662F;&#x4E00;&#x6837;&#x7684;&#x3002;</p>
<ol>
<li><p>&#x7EBF;&#x7A0B;&#x6570;&#x4E3A;1&#xFF0C;&#x4E14;use_caller&#x4E3A;true&#xFF0C;&#x5BF9;&#x5E94;&#x53EA;&#x4F7F;&#x7528;main&#x51FD;&#x6570;&#x7EBF;&#x7A0B;&#x8FDB;&#x884C;&#x534F;&#x7A0B;&#x8C03;&#x5EA6;&#x7684;&#x60C5;&#x51B5;&#x3002;</p>
</li>
<li><p>&#x7EBF;&#x7A0B;&#x6570;&#x4E3A;1&#xFF0C;&#x4E14;use_caller&#x4E3A;false&#xFF0C;&#x5BF9;&#x5E94;&#x989D;&#x5916;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x8FDB;&#x884C;&#x534F;&#x7A0B;&#x8C03;&#x5EA6;&#x3001;main&#x51FD;&#x6570;&#x7EBF;&#x7A0B;&#x4E0D;&#x53C2;&#x4E0E;&#x8C03;&#x5EA6;&#x7684;&#x60C5;&#x51B5;&#x3002;</p>
</li>
</ol>
<p>&#x8FD9;&#x91CC;&#x5148;&#x8BF4;&#x60C5;&#x51B5;2&#x3002;&#x60C5;&#x51B5;2&#x6BD4;&#x8F83;&#x597D;&#x7406;&#x89E3;&#xFF0C;&#x56E0;&#x4E3A;&#x6709;&#x5355;&#x72EC;&#x7684;&#x7EBF;&#x7A0B;&#x7528;&#x4E8E;&#x534F;&#x7A0B;&#x8C03;&#x5EA6;&#xFF0C;&#x90A3;&#x53EA;&#x9700;&#x8981;&#x8BA9;&#x65B0;&#x7EBF;&#x7A0B;&#x7684;&#x5165;&#x53E3;&#x51FD;&#x6570;&#x4F5C;&#x4E3A;&#x8C03;&#x5EA6;&#x534F;&#x7A0B;&#xFF0C;&#x4ECE;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x91CC;&#x53D6;&#x4EFB;&#x52A1;&#x6267;&#x884C;&#x5C31;&#x884C;&#x4E86;&#xFF0C;main&#x51FD;&#x6570;&#x4E0E;&#x8C03;&#x5EA6;&#x534F;&#x7A0B;&#x5B8C;&#x5168;&#x4E0D;&#x76F8;&#x5173;&#xFF0C;main&#x51FD;&#x6570;&#x53EA;&#x9700;&#x8981;&#x5411;&#x8C03;&#x5EA6;&#x5668;&#x6DFB;&#x52A0;&#x4EFB;&#x52A1;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x9002;&#x5F53;&#x7684;&#x65F6;&#x673A;&#x505C;&#x6B62;&#x8C03;&#x5EA6;&#x5668;&#x5373;&#x53EF;&#x3002;&#x5F53;&#x8C03;&#x5EA6;&#x5668;&#x505C;&#x6B62;&#x65F6;&#xFF0C;main&#x51FD;&#x6570;&#x8981;&#x7B49;&#x5F85;&#x8C03;&#x5EA6;&#x7EBF;&#x7A0B;&#x7ED3;&#x675F;&#x540E;&#x518D;&#x9000;&#x51FA;&#xFF0C;&#x53C2;&#x8003;&#x4E0B;&#x9762;&#x7684;&#x56FE;&#x793A;&#xFF1A;</p>
<div align="center">
    <img src="../../img/Scheduler/scheduler1.jpg" width="40%">
</div>


<p>&#x60C5;&#x51B5;1&#x5219;&#x6BD4;&#x8F83;&#x590D;&#x6742;&#xFF0C;&#x56E0;&#x4E3A;&#x6CA1;&#x6709;&#x989D;&#x5916;&#x7684;&#x7EBF;&#x7A0B;&#x8FDB;&#x884C;&#x534F;&#x7A0B;&#x8C03;&#x5EA6;&#xFF0C;&#x90A3;&#x53EA;&#x80FD;&#x7528;main&#x51FD;&#x6570;&#x6240;&#x5728;&#x7684;&#x7EBF;&#x7A0B;&#x6765;&#x8FDB;&#x884C;&#x8C03;&#x5EA6;&#xFF0C;&#x800C;&#x68B3;&#x7406;&#x4E00;&#x4E0B;main&#x51FD;&#x6570;&#x7EBF;&#x7A0B;&#x8981;&#x8FD0;&#x884C;&#x7684;&#x534F;&#x7A0B;&#xFF0C;&#x4F1A;&#x53D1;&#x73B0;&#x6709;&#x4EE5;&#x4E0B;&#x4E09;&#x7C7B;&#x534F;&#x7A0B;&#xFF1A;</p>
<ol>
<li><p>main&#x51FD;&#x6570;&#x5BF9;&#x5E94;&#x7684;&#x4E3B;&#x534F;&#x7A0B;</p>
</li>
<li><p>&#x8C03;&#x5EA6;&#x534F;&#x7A0B;</p>
</li>
<li><p>&#x5F85;&#x8C03;&#x5EA6;&#x7684;&#x4EFB;&#x52A1;&#x534F;&#x7A0B;</p>
</li>
</ol>
<p>&#x5728;main&#x51FD;&#x6570;&#x7EBF;&#x7A0B;&#x91CC;&#x8FD9;&#x4E09;&#x7C7B;&#x534F;&#x7A0B;&#x8FD0;&#x884C;&#x7684;&#x987A;&#x5E8F;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF1A;</p>
<ol>
<li><p>main&#x51FD;&#x6570;&#x4E3B;&#x534F;&#x7A0B;&#x8FD0;&#x884C;&#xFF0C;&#x521B;&#x5EFA;&#x8C03;&#x5EA6;&#x5668;</p>
</li>
<li><p>&#x4ECD;&#x7136;&#x662F;main&#x51FD;&#x6570;&#x4E3B;&#x534F;&#x7A0B;&#x8FD0;&#x884C;&#xFF0C;&#x5411;&#x8C03;&#x5EA6;&#x5668;&#x6DFB;&#x52A0;&#x4E00;&#x4E9B;&#x8C03;&#x5EA6;&#x4EFB;&#x52A1;</p>
</li>
<li><p>&#x5F00;&#x59CB;&#x534F;&#x7A0B;&#x8C03;&#x5EA6;&#xFF0C;main&#x51FD;&#x6570;&#x4E3B;&#x534F;&#x7A0B;&#x8BA9;&#x51FA;&#x6267;&#x884C;&#x6743;&#xFF0C;&#x5207;&#x6362;&#x5230;&#x8C03;&#x5EA6;&#x534F;&#x7A0B;&#xFF0C;&#x8C03;&#x5EA6;&#x534F;&#x7A0B;&#x4ECE;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x91CC;&#x6309;&#x987A;&#x5E8F;&#x6267;&#x884C;&#x6240;&#x6709;&#x7684;&#x4EFB;&#x52A1;</p>
</li>
<li><p>&#x6BCF;&#x6B21;&#x6267;&#x884C;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#xFF0C;&#x8C03;&#x5EA6;&#x534F;&#x7A0B;&#x90FD;&#x8981;&#x8BA9;&#x51FA;&#x6267;&#x884C;&#x6743;&#xFF0C;&#x518D;&#x5207;&#x5230;&#x8BE5;&#x4EFB;&#x52A1;&#x7684;&#x534F;&#x7A0B;&#x91CC;&#x53BB;&#x6267;&#x884C;&#xFF0C;&#x4EFB;&#x52A1;&#x6267;&#x884C;&#x7ED3;&#x675F;&#x540E;&#xFF0C;&#x8FD8;&#x8981;&#x518D;&#x5207;&#x56DE;&#x8C03;&#x5EA6;&#x534F;&#x7A0B;&#xFF0C;&#x7EE7;&#x7EED;&#x4E0B;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x7684;&#x8C03;&#x5EA6;</p>
</li>
<li><p>&#x6240;&#x6709;&#x4EFB;&#x52A1;&#x90FD;&#x6267;&#x884C;&#x5B8C;&#x540E;&#xFF0C;&#x8C03;&#x5EA6;&#x534F;&#x7A0B;&#x8FD8;&#x8981;&#x8BA9;&#x51FA;&#x6267;&#x884C;&#x6743;&#x5E76;&#x5207;&#x56DE;main&#x51FD;&#x6570;&#x4E3B;&#x534F;&#x7A0B;&#xFF0C;&#x4EE5;&#x4FDD;&#x8BC1;&#x7A0B;&#x5E8F;&#x80FD;&#x987A;&#x5229;&#x7ED3;&#x675F;&#x3002;</p>
</li>
</ol>
<p>&#x4E0A;&#x9762;&#x7684;&#x8FC7;&#x7A0B;&#x4E5F;&#x53EF;&#x4EE5;&#x603B;&#x7ED3;&#x4E3A;&#xFF1A;main&#x51FD;&#x6570;&#x5148;&#x6512;&#x4E0B;&#x4E00;&#x6CE2;&#x534F;&#x7A0B;&#xFF0C;&#x7136;&#x540E;&#x5207;&#x5230;&#x8C03;&#x5EA6;&#x534F;&#x7A0B;&#x91CC;&#x53BB;&#x6267;&#x884C;&#xFF0C;&#x7B49;&#x628A;&#x8FD9;&#x4E9B;&#x534F;&#x7A0B;&#x90FD;&#x6D88;&#x8017;&#x5B8C;&#x540E;&#xFF0C;&#x518D;&#x4ECE;&#x8C03;&#x5EA6;&#x534F;&#x7A0B;&#x5207;&#x56DE;&#x6765;&#xFF0C;&#x50CF;&#x4E0B;&#x9762;&#x8FD9;&#x6837;&#xFF1A;</p>
<div align="center">
    <img src="../../img/Scheduler/scheduler2.jpg" width="40%">
</div>


<h2 id="3-&#x6A21;&#x5757;&#x5B9E;&#x73B0;">3. &#x6A21;&#x5757;&#x5B9E;&#x73B0;</h2>
<h3 id="31-fiberandthread">3.1 FiberAndThread</h3>
<blockquote>
<p>&#x8C03;&#x5EA6;&#x4EFB;&#x52A1;</p>
</blockquote>
<p>&#x53EF;&#x4EE5;&#x662F;&#x534F;&#x7A0B;&#xFF0C;&#x53EF;&#x4EE5;&#x662F;&#x51FD;&#x6570;&#xFF0C;&#x5C01;&#x88C5;&#x6210;&#x4E00;&#x79CD;&#x7C7B;&#x578B;&#xFF0C;&#x53EF;&#x6307;&#x5B9A;&#x8C03;&#x5EA6;&#x7EBF;&#x7A0B;&#x3002;</p>
<h3 id="32-&#x53D8;&#x91CF;">3.2 &#x53D8;&#x91CF;</h3>
<h4 id="321-scheduler&#x6210;&#x5458;&#x53D8;&#x91CF;">3.2.1 Scheduler&#x6210;&#x5458;&#x53D8;&#x91CF;</h4>
<pre><code class="lang-C++">MutexType m_mutex;                                  <span class="hljs-comment">// Mutex</span>
<span class="hljs-built_in">std</span>::<span class="hljs-built_in">vector</span>&lt;Thread::ptr&gt; m_threads;                 <span class="hljs-comment">// &#x7EBF;&#x7A0B;&#x6C60;</span>
<span class="hljs-built_in">std</span>::<span class="hljs-built_in">list</span>&lt;FiberAndThread&gt; m_fibers;                 <span class="hljs-comment">// &#x5F85;&#x6267;&#x884C;&#x7684;&#x534F;&#x7A0B;&#x961F;&#x5217;</span>
Fiber::ptr m_rootFiber;                             <span class="hljs-comment">// use_caller&#x4E3A;true&#x65F6;&#x6709;&#x6548;, &#x8C03;&#x5EA6;&#x534F;&#x7A0B;</span>
<span class="hljs-built_in">std</span>::<span class="hljs-built_in">string</span> m_name;                                 <span class="hljs-comment">// &#x534F;&#x7A0B;&#x8C03;&#x5EA6;&#x5668;&#x540D;&#x79F0;</span>

<span class="hljs-built_in">std</span>::<span class="hljs-built_in">vector</span>&lt;<span class="hljs-keyword">int</span>&gt; m_threadIds;                       <span class="hljs-comment">// &#x534F;&#x7A0B;&#x4E0B;&#x7684;&#x7EBF;&#x7A0B;id&#x6570;&#x7EC4;</span>
<span class="hljs-keyword">size_t</span> m_threadCount = <span class="hljs-number">0</span>;                           <span class="hljs-comment">// &#x7EBF;&#x7A0B;&#x6570;&#x91CF;</span>
<span class="hljs-built_in">std</span>::atomic&lt;<span class="hljs-keyword">size_t</span>&gt; m_activeThreadCount = {<span class="hljs-number">0</span>};      <span class="hljs-comment">// &#x5DE5;&#x4F5C;&#x7EBF;&#x7A0B;&#x6570;&#x91CF;</span>
<span class="hljs-built_in">std</span>::atomic&lt;<span class="hljs-keyword">size_t</span>&gt; m_idleThreadCount = {<span class="hljs-number">0</span>};        <span class="hljs-comment">// &#x7A7A;&#x95F2;&#x7EBF;&#x7A0B;&#x6570;&#x91CF;</span>
<span class="hljs-keyword">bool</span> m_stopping = <span class="hljs-literal">true</span>;                             <span class="hljs-comment">// &#x662F;&#x5426;&#x6B63;&#x5728;&#x505C;&#x6B62;</span>
<span class="hljs-keyword">bool</span> m_autoStop = <span class="hljs-literal">false</span>;                            <span class="hljs-comment">// &#x662F;&#x5426;&#x81EA;&#x52A8;&#x505C;&#x6B62;</span>
<span class="hljs-keyword">int</span> m_rootThread = <span class="hljs-number">0</span>;                               <span class="hljs-comment">// &#x4E3B;&#x7EBF;&#x7A0B;id(use_caller)</span>
</code></pre>
<h4 id="322-&#x5168;&#x5C40;&#x4E0E;&#x7EBF;&#x7A0B;&#x5C40;&#x90E8;&#x53D8;&#x91CF;">3.2.2 &#x5168;&#x5C40;&#x4E0E;&#x7EBF;&#x7A0B;&#x5C40;&#x90E8;&#x53D8;&#x91CF;</h4>
<pre><code class="lang-C++">
<span class="hljs-comment">// &#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#x7684;&#x8C03;&#x5EA6;&#x5668;&#xFF0C;&#x540C;&#x4E00;&#x4E2A;&#x8C03;&#x5EA6;&#x5668;&#x4E0B;&#x7684;&#x6240;&#x6709;&#x7EBF;&#x7A0B;&#x6307;&#x540C;&#x540C;&#x4E00;&#x4E2A;&#x8C03;&#x5EA6;&#x5668;&#x5B9E;&#x4F8B;</span>
<span class="hljs-keyword">static</span> <span class="hljs-keyword">thread_local</span> Scheduler *t_scheduler = <span class="hljs-literal">nullptr</span>;
<span class="hljs-comment">// &#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#x7684;&#x8C03;&#x5EA6;&#x534F;&#x7A0B;&#xFF0C;&#x6BCF;&#x4E2A;&#x7EBF;&#x7A0B;&#x90FD;&#x72EC;&#x6709;&#x4E00;&#x4EFD;&#xFF0C;&#x5305;&#x62EC;caller&#x7EBF;&#x7A0B;</span>
<span class="hljs-keyword">static</span> <span class="hljs-keyword">thread_local</span> Fiber *t_scheduler_fiber = <span class="hljs-literal">nullptr</span>;
</code></pre>
<p><code>t_scheduler_fiber</code>&#x4FDD;&#x5B58;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#x7684;&#x8C03;&#x5EA6;&#x534F;&#x7A0B;&#xFF0C;&#x52A0;&#x4E0A;<code>Fiber</code>&#x6A21;&#x5757;&#x7684;<code>t_fiber</code>&#x548C;<code>t_thread_fiber</code>&#xFF0C;&#x6BCF;&#x4E2A;&#x7EBF;&#x7A0B;&#x603B;&#x5171;&#x53EF;&#x4EE5;&#x8BB0;&#x5F55;&#x4E09;&#x4E2A;&#x534F;&#x7A0B;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x4FE1;&#x606F;&#x3002;</p>
<h3 id="33-&#x8C03;&#x5EA6;&#x5668;&#x7684;&#x6784;&#x9020;">3.3 &#x8C03;&#x5EA6;&#x5668;&#x7684;&#x6784;&#x9020;</h3>
<p>&#x5728;user_caller&#x4E3A;true&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x521D;&#x59CB;&#x5316;caller&#x7EBF;&#x7A0B;&#x7684;&#x8C03;&#x5EA6;&#x534F;&#x7A0B;&#xFF0C;caller&#x7EBF;&#x7A0B;&#x7684;&#x8C03;&#x5EA6;&#x534F;&#x7A0B;&#x4E0D;&#x4F1A;&#x88AB;&#x8C03;&#x5EA6;&#x5668;&#x8C03;&#x5EA6;&#xFF0C;&#x800C;&#x4E14;&#xFF0C;caller&#x7EBF;&#x7A0B;&#x7684;&#x8C03;&#x5EA6;&#x534F;&#x7A0B;&#x505C;&#x6B62;&#x65F6;&#xFF0C;&#x5E94;&#x8BE5;&#x8FD4;&#x56DE;caller&#x7EBF;&#x7A0B;&#x7684;&#x4E3B;&#x534F;&#x7A0B;&#x3002;</p>
<h3 id="34-&#x8C03;&#x5EA6;&#x5668;&#x7684;&#x542F;&#x52A8;">3.4 &#x8C03;&#x5EA6;&#x5668;&#x7684;&#x542F;&#x52A8;</h3>
<p>&#x521D;&#x59CB;&#x5316;&#x8C03;&#x5EA6;&#x7EBF;&#x7A0B;&#x6C60;&#xFF0C;&#x5982;&#x679C;&#x53EA;&#x4F7F;&#x7528;caller&#x7EBF;&#x7A0B;&#x8FDB;&#x884C;&#x8C03;&#x5EA6;&#xFF0C;&#x90A3;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x5565;&#x4E5F;&#x4E0D;&#x505A;&#x3002;</p>
<h3 id="35-&#x5224;&#x65AD;&#x8C03;&#x5EA6;&#x5668;&#x662F;&#x5426;&#x505C;&#x6B62;">3.5 &#x5224;&#x65AD;&#x8C03;&#x5EA6;&#x5668;&#x662F;&#x5426;&#x505C;&#x6B62;</h3>
<p>&#x53EA;&#x6709;&#x5F53;&#x6240;&#x6709;&#x7684;&#x4EFB;&#x52A1;&#x90FD;&#x88AB;&#x6267;&#x884C;&#x5B8C;&#x4E86;&#xFF0C;&#x8C03;&#x5EA6;&#x5668;&#x624D;&#x53EF;&#x4EE5;&#x505C;&#x6B62;&#x3002;</p>
<h3 id="36-&#x8C03;&#x5EA6;&#x5668;&#x7684;&#x8FD0;&#x884C;">3.6 &#x8C03;&#x5EA6;&#x5668;&#x7684;&#x8FD0;&#x884C;</h3>
<p>&#x5185;&#x90E8;&#x6709;&#x4E00;&#x4E2A;while(true)&#x5FAA;&#x73AF;&#xFF0C;&#x4E0D;&#x505C;&#x5730;&#x4ECE;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x53D6;&#x4EFB;&#x52A1;&#x5E76;&#x6267;&#x884C;&#xFF0C;&#x7531;&#x4E8E;Fiber&#x7C7B;&#x6539;&#x9020;&#x8FC7;&#xFF0C;&#x6BCF;&#x4E2A;&#x88AB;&#x8C03;&#x5EA6;&#x5668;&#x6267;&#x884C;&#x7684;&#x534F;&#x7A0B;&#x5728;&#x7ED3;&#x675F;&#x65F6;&#x90FD;&#x4F1A;&#x56DE;&#x5230;&#x8C03;&#x5EA6;&#x534F;&#x7A0B;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x91CC;&#x4E0D;&#x7528;&#x62C5;&#x5FC3;&#x8DD1;&#x98DE;&#x95EE;&#x9898;&#xFF0C;&#x5F53;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x4E3A;&#x7A7A;&#x65F6;&#xFF0C;&#x4EE3;&#x7801;&#x4F1A;&#x8FDB;idle&#x534F;&#x7A0B;&#xFF0C;&#x4F46;idle&#x534F;&#x7A0B;&#x5565;&#x4E5F;&#x4E0D;&#x505A;&#x76F4;&#x63A5;&#x5C31;yield&#x4E86;&#xFF0C;&#x72B6;&#x6001;&#x8FD8;&#x662F;READY&#x72B6;&#x6001;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x91CC;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x4E2A;&#x5FD9;&#x7B49;&#x5F85;&#xFF0C;CPU&#x5360;&#x7528;&#x7387;&#x7206;&#x70B8;&#xFF0C;&#x53EA;&#x6709;&#x5F53;&#x8C03;&#x5EA6;&#x5668;&#x68C0;&#x6D4B;&#x5230;&#x505C;&#x6B62;&#x6807;&#x5FD7;&#x65F6;&#xFF0C;idle&#x534F;&#x7A0B;&#x624D;&#x4F1A;&#x771F;&#x6B63;&#x7ED3;&#x675F;&#xFF0C;&#x8C03;&#x5EA6;&#x534F;&#x7A0B;&#x4E5F;&#x4F1A;&#x68C0;&#x6D4B;&#x5230;idle&#x534F;&#x7A0B;&#x72B6;&#x6001;&#x4E3A;TERM&#xFF0C;&#x5E76;&#x4E14;&#x968F;&#x4E4B;&#x9000;&#x51FA;&#x6574;&#x4E2A;&#x8C03;&#x5EA6;&#x534F;&#x7A0B;&#x3002;&#x8FD9;&#x91CC;&#x8FD8;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x4E00;&#x70B9;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x534F;&#x7A0B;&#xFF0C;&#x53EA;&#x8981;&#x5176;&#x4ECE;resume&#x4E2D;&#x8FD4;&#x56DE;&#x4E86;&#xFF0C;&#x90A3;&#x4E0D;&#x7BA1;&#x5B83;&#x7684;&#x72B6;&#x6001;&#x662F;TERM&#x8FD8;&#x662F;READY&#xFF0C;&#x8C03;&#x5EA6;&#x5668;&#x90FD;&#x4E0D;&#x4F1A;&#x81EA;&#x52A8;&#x5C06;&#x5176;&#x518D;&#x6B21;&#x52A0;&#x5165;&#x8C03;&#x5EA6;&#xFF0C;&#x56E0;&#x4E3A;&#x4E00;&#x4E2A;&#x6210;&#x719F;&#x7684;&#x534F;&#x7A0B;&#x662F;&#x8981;&#x5B66;&#x4F1A;&#x81EA;&#x6211;&#x7BA1;&#x7406;&#x7684;&#x3002;</p>
<h3 id="37-&#x8C03;&#x5EA6;&#x5668;&#x7684;&#x505C;&#x6B62;">3.7 &#x8C03;&#x5EA6;&#x5668;&#x7684;&#x505C;&#x6B62;</h3>
<p>&#x5728;&#x4F7F;&#x7528;&#x4E86;caller&#x7EBF;&#x7A0B;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8C03;&#x5EA6;&#x5668;&#x4F9D;&#x8D56;stop&#x65B9;&#x6CD5;&#x6765;&#x6267;&#x884C;caller&#x7EBF;&#x7A0B;&#x7684;&#x8C03;&#x5EA6;&#x534F;&#x7A0B;&#xFF0C;&#x5982;&#x679C;&#x8C03;&#x5EA6;&#x5668;&#x53EA;&#x4F7F;&#x7528;&#x4E86;caller&#x7EBF;&#x7A0B;&#x6765;&#x8C03;&#x5EA6;&#xFF0C;&#x90A3;&#x8C03;&#x5EA6;&#x5668;&#x771F;&#x6B63;&#x5F00;&#x59CB;&#x6267;&#x884C;&#x8C03;&#x5EA6;&#x7684;&#x4F4D;&#x7F6E;&#x5C31;&#x662F;&#x8FD9;&#x4E2A;stop&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x505C;&#x6B62;&#x8C03;&#x5EA6;&#x5668;&#x7684;&#x7B56;&#x7565;&#xFF1A;</p>
<ol>
<li>&#x8BBE;&#x7F6E;m_stopping&#x6807;&#x5FD7;&#xFF0C;&#x8BE5;&#x6807;&#x5FD7;&#x8868;&#x793A;&#x6B63;&#x5728;&#x505C;&#x6B62;</li>
<li>&#x68C0;&#x6D4B;&#x662F;&#x5426;&#x4F7F;&#x7528;&#x4E86;caller&#x7EBF;&#x7A0B;&#x8FDB;&#x884C;&#x8C03;&#x5EA6;&#xFF0C;&#x5982;&#x679C;&#x4F7F;&#x7528;&#x4E86;caller&#x7EBF;&#x7A0B;&#x8FDB;&#x884C;&#x8C03;&#x5EA6;&#xFF0C;&#x90A3;&#x8981;&#x4FDD;&#x8BC1;stop&#x65B9;&#x6CD5;&#x662F;&#x7531;caller&#x7EBF;&#x7A0B;&#x53D1;&#x8D77;&#x7684;</li>
<li>&#x901A;&#x77E5;&#x5176;&#x4ED6;&#x8C03;&#x5EA6;&#x7EBF;&#x7A0B;&#x7684;&#x8C03;&#x5EA6;&#x534F;&#x7A0B;&#x9000;&#x51FA;&#x8C03;&#x5EA6;</li>
<li>&#x901A;&#x77E5;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#x7684;&#x8C03;&#x5EA6;&#x534F;&#x7A0B;&#x9000;&#x51FA;&#x8C03;&#x5EA6;</li>
<li>&#x5982;&#x679C;&#x4F7F;&#x7528;&#x4E86;caller&#x7EBF;&#x7A0B;&#x8FDB;&#x884C;&#x8C03;&#x5EA6;&#xFF0C;&#x90A3;&#x6267;&#x884C;&#x4E00;&#x6B21;caller&#x7EBF;&#x7A0B;&#x7684;&#x8C03;&#x5EA6;&#x534F;&#x7A0B;&#xFF08;&#x53EA;&#x4F7F;&#x7528;caller&#x7EBF;&#x7A0B;&#x65F6;&#x7684;&#x534F;&#x7A0B;&#x8C03;&#x5EA6;&#x5168;&#x4EF0;&#x4ED7;&#x8FD9;&#x4E2A;&#x64CD;&#x4F5C;&#xFF09;</li>
<li>&#x7B49;caller&#x7EBF;&#x7A0B;&#x7684;&#x8C03;&#x5EA6;&#x534F;&#x7A0B;&#x8FD4;&#x56DE;</li>
<li>&#x7B49;&#x6240;&#x6709;&#x8C03;&#x5EA6;&#x7EBF;&#x7A0B;&#x7ED3;&#x675F;</li>
</ol>
<h2 id="4-&#x603B;&#x7ED3;">4. &#x603B;&#x7ED3;</h2>
<p>&#x534F;&#x7A0B;&#x8C03;&#x5EA6;&#x6A21;&#x5757;&#x56E0;&#x4E3A;&#x5B58;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x7A7A;&#x95F2;&#x65F6;&#x8C03;&#x5EA6;&#x7EBF;&#x7A0B;&#x5FD9;&#x7B49;&#x5F85;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6240;&#x4EE5;&#x5B9E;&#x9645;&#x4E0A;&#x5E76;&#x4E0D;&#x5B9E;&#x7528;&#xFF0C;&#x771F;&#x6B63;&#x5B9E;&#x7528;&#x7684;&#x662F;&#x540E;&#x9762;&#x57FA;&#x4E8E;Scheduler&#x5B9E;&#x73B0;&#x7684;IOManager&#x3002;&#x7531;&#x4E8E;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x7684;&#x4EFB;&#x52A1;&#x662F;&#x6309;&#x987A;&#x5E8F;&#x6267;&#x884C;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x5360;&#x7528;&#x4E86;&#x6BD4;&#x8F83;&#x957F;&#x65F6;&#x95F4;&#xFF0C;&#x90A3;&#x5176;&#x4ED6;&#x4EFB;&#x52A1;&#x7684;&#x6267;&#x884C;&#x4F1A;&#x53D7;&#x5230;&#x5F71;&#x54CD;&#xFF0C;&#x5982;&#x679C;&#x4EFB;&#x52A1;&#x6267;&#x884C;&#x7684;&#x662F;&#x50CF;while(1)&#x8FD9;&#x6837;&#x7684;&#x5FAA;&#x73AF;&#xFF0C;&#x90A3;&#x7EBF;&#x7A0B;&#x6570;&#x4E0D;&#x591F;&#x65F6;&#xFF0C;&#x540E;&#x9762;&#x7684;&#x4EFB;&#x52A1;&#x90FD;&#x4E0D;&#x4F1A;&#x5F97;&#x5230;&#x6267;&#x884C;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x5F53;&#x524D;&#x8FD8;&#x6CA1;&#x6709;&#x5B9E;&#x73B0;hook&#x529F;&#x80FD;&#xFF0C;&#x50CF;sleep&#x548C;&#x7B49;&#x5F85;IO&#x5C31;&#x7EEA;&#x8FD9;&#x6837;&#x7684;&#x64CD;&#x4F5C;&#x4E5F;&#x4F1A;&#x963B;&#x585E;&#x534F;&#x7A0B;&#x8C03;&#x5EA6;&#x3002;</p>

                        
                    </section>
                    
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                </div>
            </div>
            
        </div>

        
        
        <a href="../Fiber/"
           class="navigation navigation-prev "
           aria-label="Previous page: 协程模块">
            <i class="fa fa-angle-left"></i>
        </a>
        
        
        <a href="../IOManager/"
           class="navigation navigation-next "
           aria-label="Next page: IO协程调度模块">
            <i class="fa fa-angle-right"></i>
        </a>
        
        
        
    </div>
    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"协程调度模块","level":"1.4.6","depth":2,"next":{"title":"IO协程调度模块","level":"1.4.7","depth":2,"path":"server/IOManager/README.md","ref":"server/IOManager/README.md","articles":[]},"previous":{"title":"协程模块","level":"1.4.5","depth":2,"path":"server/Fiber/README.md","ref":"server/Fiber/README.md","articles":[]},"dir":"ltr"},"config":{"plugins":["insert-logo","favicon","-lunr","-search","search-pro","splitter","github","-copy-code-button","code","chapter-fold","theme-hqbook","livereload"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"chapter-fold":{},"github":{"url":"https://github.com/JUHPS"},"livereload":{},"splitter":{},"search-pro":{},"code":{"copyButtons":true},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"favicon":{"shortcut":"/img/favicon.png","bookmark":"/img/favicon.png","appleTouch":"/img/favicon.png","appleTouchMore":{"120x120":"/img/favicon.png","180x180":"/img/favicon.png"}},"theme-hqbook":{"copyButtons":true,"copyLines":true,"dragSplitter":false,"favicon":"https://github.com/JUHPS/juhps-docs/blob/master/img/favicon.png?raw=true","flexible-linkcard":{"hrefUrl":"https://github.com/JUHPS/juhps-docs/","imgClass":"rect","imgSrc":"https://github.com/JUHPS/juhps-docs/blob/master/img/favicon.png?raw=true","target":"_blank","title":"flexible-linkcard"},"logo":"https://github.com/JUHPS/juhps-docs/blob/master/img/favicon.png?raw=true","search-placeholder":"输入关键字搜索","hide-elements":[".summary .gitbook-link"]},"sharing":{"facebook":false,"twitter":false,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"insert-logo":{"style":"background: none; max-height: 100px; min-height: 30px","url":"https://github.com/JUHPS/juhps-docs/blob/master/img/favicon.png?raw=true"}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{"themeHqbook":{"nav":[{}]}},"title":"High Performance Web Server manual","links":{"sidebar":{"GitHub":"http://github.com/JUHPS"},"sharing":{"google":false,"facebook":false,"twitter":false,"weibo":false,"all":null}},"gitbook":"*","description":"The manual of High Performance Web Server"},"file":{"path":"server/Scheduler/README.md","mtime":"2023-01-29T06:51:32.796Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2023-04-10T16:05:15.677Z"},"basePath":"../..","book":{"language":""}})
        });
    </script>
</div>

        
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="../../gitbook/gitbook-plugin-insert-logo/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-code/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-chapter-fold/chapter-fold.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-theme-hqbook/theme.js"></script>
        
    

    </body>
</html>

